# Taps
tap 'caskroom/cask'
# tap 'caskroom/eid'
tap 'caskroom/fonts'
tap 'caskroom/versions'
tap 'homebrew/bundle'

# Binaries
brew 'autojump'
brew 'awscli'
brew 'bash' # Bash 4
brew 'bat'
brew 'coreutils' # Those that come with macOS are outdated
brew 'direnv'
brew 'git'
brew 'git-extras'
brew 'git-flow'
brew 'grep'
brew 'mackup'
# brew 'mas'
brew 'pkg-config' # https://github.com/driesvints/dotfiles/issues/20
brew 'tree'
brew 'zsh'
brew 'zsh-completions'

# Development
cask java
# Note: adoptopenjdk is a pre-requisite for sbt
cask 'adoptopenjdk'
# brew 'php'
# brew 'imagick'
# brew 'mysql'
brew 'node'
brew 'sbt'
cask 'intellij-idea-ce'

# Apps
# cask 'aerial'
# cask 'alfred'
# cask 'caffeine'
# cask 'discord'
# cask 'docker'
# cask 'dropbox'
# cask 'dynamodb-local'
# cask 'eid-be'
# cask 'eid-be-viewer'
cask 'firefox'
cask 'google-backup-and-sync'
# cask 'google-drive-file-stream'
cask 'google-chrome'
# cask 'gpg-suite'
# cask 'grammarly'
# cask 'insomnia'
cask 'iterm2'
# cask 'mysqlworkbench'
# cask 'now'
# cask 'phpstorm'
# cask 'quip'
# cask 'sequel-pro'
# cask 'shuttle'
cask 'signal'
cask 'skype'
cask 'slack'
cask 'spotify'
cask 'sublime-text'
# cask 'tableplus'
cask 'tor-browser'
# cask 'tower2'
# cask 'transmit'
# cask 'vagrant'
# cask 'virtualbox'
# cask 'virtualbox-extension-pack'
# cask 'vlc'
cask 'whatsapp'

# Quicklook
cask 'qlcolorcode'
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'quicklook-csv'
cask 'qlstephen'

# Fonts
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'

# NOTE (as of 2019-04): The mas command-line interface to the App Store doesn't appear to work
# Mac App Store
# mas '1Password', id: 1333542190
# mas 'Byword', id: 420212497
# mas 'Deckset', id: 847496013
# mas 'Giphy Capture', id: 668208984
# mas 'Sip', id: 507257563
# mas 'Spark', id: 1176895641
# mas 'The Unarchiver', id: 425424353
# mas 'Things', id: 904280696
# mas 'Tweetbot', id: 1384080005
# mas 'WhatsApp', id: 1147396723
# mas 'Witch', id: 412485838
